Revit 2027 API
AirFanType Enumeration
 The type of air fan.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AirFanType
Public Enumeration AirFanType
public enum class AirFanType
type AirFanType
Members
Member name | Value | Description
ConstantVolume | 0
VariableVolume | 1
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace